devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        return true;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static void disable_I2C(u8_t major)
{
        const I2C_config_t *cfg = &I2C_cfg[major];
        I2C_t              *i2c = (I2C_t *)I2C_cfg[major].I2C;

        NVIC_DisableIRQ(I2C1_EV_IRQn);
        NVIC_DisableIRQ(I2C1_ER_IRQn);

        WRITE_REG(i2c->CR1, 0);
        SET_BIT(RCC->APB1RSTR, cfg->I2C_clken);
        CLEAR_BIT(RCC->APB1RSTR, cfg->I2C_clken);
        CLEAR_BIT(RCC->APB1ENR, cfg->I2C_clken);

        I2C->periph[major].initialized = false;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool wait_for_event(I2C_dev_t *hdl)
{
        SET_BIT(get_I2C(hdl)->CR2, I2C_CR2_ITEVTEN);

        if (!semaphore_wait(I2C->periph[hdl->config->major].event, timeout)) {
                I2C->periph[hdl->config->major].error = true;
                errno = ETIME;
                return false;
        }

        if (I2C->periph[hdl->config->major].error) {
                errno = EIO;
                return false;
        }

        return true;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool I2C_start(I2C_dev_t *hdl)
{
        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);
        return wait_for_event(hdl);
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool I2C_send_address(I2C_dev_t *hdl, bool wr)
{
        I2C_t *i2c = get_I2C(hdl);
        u16_t  tmp;
        (void) tmp;

        if (hdl->config->addr10bit) {
                tmp = i2c->SR1;
                i2c->DR = header10b | ((hdl->config->addr & 0x300) >> 7);
                if (!wait_for_event(hdl))
                        return false;

                tmp = i2c->SR1;
                i2c->DR = hdl->config->addr;
                if (!wait_for_event(hdl))
                        return false;

                if (!wr) {
                        if (!I2C_start(hdl))
                                return false;

                        tmp = i2c->SR1;
                        i2c->DR = header10b | ((hdl->config->addr & 0x300) >> 7) | 0x01;
                        if (!wait_for_event(hdl))
                                return false;
                }
        } else {
                u8_t addr = hdl->config->addr & 0xFE;

                if (!wr)
                        addr |= 0x01;

                tmp = i2c->SR1;
                i2c->DR = addr;
                if (!wait_for_event(hdl))
                        return false;
        }

        return true;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool I2C_send_sub_address(I2C_dev_t *hdl, u32_t addr)
{
        I2C_t *i2c = get_I2C(hdl);
        u16_t  tmp;
        (void) tmp;


        switch (hdl->config->sub_addr_mode) {
        default:
                break;

        case I2C_SUB_ADDR_MODE__3_BYTES:
                tmp = i2c->SR1;
                tmp = i2c->SR2;
                i2c->DR = addr >> 16;
                if (!wait_for_event(hdl))
                        return false;
                // flow through

        case I2C_SUB_ADDR_MODE__2_BYTES:
                tmp = i2c->SR1;
                tmp = i2c->SR2;
                i2c->DR = addr >> 8;
                if (!wait_for_event(hdl))
                        return false;
                // flow through

        case I2C_SUB_ADDR_MODE__1_BYTE:
                tmp = i2c->SR1;
                tmp = i2c->SR2;
                i2c->DR = addr;
                if (!wait_for_event(hdl))
                        return false;
                break;
        }

        return true;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static ssize_t I2C_transmit(I2C_dev_t *hdl, const u8_t *src, size_t size)
{
        I2C_t *i2c = get_I2C(hdl);

        if (I2C_cfg[hdl->config->major].use_DMA) {
                // TODO
        } else {
                I2C->periph[hdl->config->major].data = const_cast(u8_t*, src);
                I2C->periph[hdl->config->major].size = size;

                SET_BIT(i2c->CR2, I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);

                if (!wait_for_event(hdl)) {
                        return 0;
                }
        }

        return size - I2C->periph[hdl->config->major].size;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static ssize_t I2C_receive(I2C_dev_t *hdl, u8_t *dst, size_t size)
{

}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static void I2C_stop(I2C_dev_t *hdl)
{
        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_STOP);
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool IRQ_EV_handler(u8_t major)
{
        I2C_t *i2c  = const_cast(I2C_t*, I2C_cfg[major].I2C);
        bool  woken = false;

        if ((i2c->SR1 & I2C_SR1_TXE) && (i2c->SR2 & I2C_SR2_TRA)) {
                if (I2C->periph[major].size) {
                        i2c->DR = *(I2C->periph[major].data++);
                        I2C->periph[major].size--;
                } else {
                        semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
                }

        } else if ((i2c->SR1 & I2C_SR1_RXNE) && !(i2c->SR2 & I2C_SR2_TRA)) {
                if (I2C->periph[major].size) {
                        if (I2C->periph[major].size == 1)
                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                        else
                                SET_BIT(i2c->CR1, I2C_CR1_ACK);

                        *(I2C->periph[major].data++) = i2c->DR;
                        I2C->periph[major].size--;
                } else {
                        semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
                }

        } else {
                semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
        }

        return woken;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool IRQ_ER_handler(u8_t major)
{
        I2C_t *i2c = const_cast(I2C_t*, I2C_cfg[major].I2C);

        I2C->periph[major].error = true;

        WRITE_REG(i2c->SR1, 0);
        CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN);
        CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN);

